app/Controllers/DispositivoController.php

SELECT *
FROM `rack`
---
    public function guardar()
    {
        $model = new DispositivoModel();
        $model->insert([
            'Nombre' => $this->request->getPost('nombre'),
            'MAC' => $this->request->getPost('mac'),
            'Estado' => $this->request->getPost('estado'),
            "usuario_id" => session()->get("user_id"),
            "Nivel" => 1,
            "ID_Rack" => 1
        ]);