app/Models/AlertaModel.php

SELECT COUNT(*) AS `numrows`
FROM `alertas`
JOIN `rack` ON `alertas`.`id_rack` = `rack`.`id_rack`
JOIN `empresa` ON `rack`.`id_empresa` = `empresa`.`id_empresa`
WHERE `rack`.`id_empresa` = '1'
SELECT `alertas`.*, `rack`.`id_empresa`, `empresa`.`nombre` AS `nombre_empresa`
FROM `alertas`
JOIN `rack` ON `alertas`.`id_rack` = `rack`.`id_rack`
JOIN `empresa` ON `rack`.`id_empresa` = `empresa`.`id_empresa`
WHERE `rack`.`id_empresa` = '1'
ORDER BY `alertas`.`fecha` DESC
 LIMIT 10
---
    public function getAlertasByEmpresaPaginadas($id_empresa, $perPage = 10)
    {
        return $this->select('alertas.*, rack.id_empresa, empresa.nombre AS nombre_empresa')
                ->join('rack', 'alertas.id_rack = rack.id_rack')
                ->join('empresa', 'rack.id_empresa = empresa.id_empresa')
                ->where('rack.id_empresa', $id_empresa)
                ->orderBy('alertas.fecha', 'DESC')
                ->paginate($perPage);