app/Models/Esp32Model.php

public function insertar_registro($uid)
{
    $table = $this->db->table('registro_acceso_rf');
    $tarjeta = $this->buscar_id($uid);

    if (empty($tarjeta)) return false;

    // Buscamos el rack de la empresa de la tarjeta
    $id_empresa = $tarjeta[0]['id_empresa'];
    $rack = $this->db->table('racks')
                 ->where('id_empresa', $id_empresa)
                 ->get()
                 ->getRowArray(); // o getResultArray si puede haber varios

    $data = [
        "Resultado"       => $tarjeta[0]["Estado"],
        "Accion_Tomada"   => NULL,
        "Archivo_Video"   => NULL,
        "Ubicacion_Camara"=> NULL,
        "ID_Rack"         => $rack['ID_Rack'] ?? null, // agarramos el rack de esa empresa
        "ID_Tarjeta"      => $tarjeta[0]["ID_Tarjeta"]
    ];

    $table->insert($data);
---
INSERT INTO `registro_acceso_rf` (`Resultado`, `Accion_Tomada`, `Archivo_Video`, `Ubicacion_Camara`, `ID_Sistema`, `ID_Tarjeta`) VALUES ('1', NULL, NULL, NULL, NULL, '42')

    public function buscar_id($id)
    {

        return $this->db->table('tarjeta_acceso')
                        ->where(["UID" => $id])
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tarjeta_acceso`
WHERE `UID` = '0x352d930289'

public function vincular_dispositivo($device_id, $ssid, $password, $nombre, $empresa_id, $id_rack, $nivel)
{
    $table = $this->db->table('sistema_seguridad');

    $existing_device = $table->where('codevin', $device_id)->get()->getRow();
---
SELECT *
FROM `sistema_seguridad`
WHERE `codevin` = '58:BF:25:82:87:88'