app/Models/TarjetaModel.php

    public function obtenerEstado($idTarjeta)
    {
        $tabla = $this->db->table("tarjeta_acceso"); // Accede a la tabla 'tarjeta_acceso'
        $tabla->where('ID_Tarjeta', $idTarjeta); // Aplica una condición para buscar la tarjeta por ID
        return $tabla->get()->getResultArray(); // Devuelve el resultado de la búsqueda como un array
---
SELECT *
FROM `tarjeta_acceso`
WHERE `ID_Tarjeta` = '42'